In [66]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

from numpy.random import rand

In [67]:
#Create Series
ser1=Series([1,2,3,4],index=['A','B','C','D'])

print (ser1)

A    1
B    2
C    3
D    4
dtype: int64

In [68]:
#Create Re Indexing
ser2=ser1.reindex(['A','B','C','D','E','F'])

In [69]:
print (ser2)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [82]:

ser2.reindex(['A','B','C','D','E','F','G'],fill_value='BB')

A      1
B      2
C      3
D      4
E    NaN
F    NaN
G     BB
dtype: object

In [83]:
ser3=Series(['USA','Mexico','Canada'],index=[0,5,10])

In [84]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [92]:
ranger=range(15)

In [93]:
ser3.reindex(ranger,method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [94]:
#Create Dataframe with the index and columns.
dframe = DataFrame(np.arange(25).reshape(5,5), index=['A','B','C','D','E'],columns=['Col1','Col2','Col3','Col4','Col5'])

dframe

   Col1  Col2  Col3  Col4  Col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19
E    20    21    22    23    24

In [95]:
dframe2=dframe.reindex(['A','B','C','D','E','F','G'])

dframe2

   Col1  Col2  Col3  Col4  Col5
A   0.0   1.0   2.0   3.0   4.0
B   5.0   6.0   7.0   8.0   9.0
C  10.0  11.0  12.0  13.0  14.0
D  15.0  16.0  17.0  18.0  19.0
E  20.0  21.0  22.0  23.0  24.0
F   NaN   NaN   NaN   NaN   NaN
G   NaN   NaN   NaN   NaN   NaN

In [96]:
new_columns=['Col1','Col2','Col3','Col4','Col5','Col6']

In [101]:
dframe2.reindex(columns=['Col1','Col2','Col3','Col4','Col5','Col6'])
dframe2.reindex(columns=new_columns)

   Col1  Col2  Col3  Col4  Col5  Col6
A   0.0   1.0   2.0   3.0   4.0   NaN
B   5.0   6.0   7.0   8.0   9.0   NaN
C  10.0  11.0  12.0  13.0  14.0   NaN
D  15.0  16.0  17.0  18.0  19.0   NaN
E  20.0  21.0  22.0  23.0  24.0   NaN
F   NaN   NaN   NaN   NaN   NaN   NaN
G   NaN   NaN   NaN   NaN   NaN   NaN

In [79]:
dframe

   Col1  Col2  Col3  Col4  Col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19
E    20    21    22    23    24

In [104]:
dframe.ix[['A','B','C','D','E','F'],new_columns]

   Col1  Col2  Col3  Col4  Col5  Col6
A   0.0   1.0   2.0   3.0   4.0   NaN
B   5.0   6.0   7.0   8.0   9.0   NaN
C  10.0  11.0  12.0  13.0  14.0   NaN
D  15.0  16.0  17.0  18.0  19.0   NaN
E  20.0  21.0  22.0  23.0  24.0   NaN
F   NaN   NaN   NaN   NaN   NaN   NaN